Documents/НачислениеКоммунальногоНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>НачислениеКоммунальногоНалога</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднесписочнаяЧисленность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаКоммунальногоНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеоблагаемыйМинимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтражениеВУчете</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяВаловыхРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Налоговый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Налоговый</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Налоговый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Catalogs/СпособыОтраженияЗарплатыВРеглУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияЗарплатыВРеглУчете</Name>
			<Comment>(Регл)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначениеДоходовИЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСтатьяВаловыхРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзносыОсновногоНачисления</Name>
					<Comment>Особый способ отражения для ЕСВ ФОТ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЕСВФОТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/НачислениеКоммунальногоНалога/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;
Перем мСведенияОСчетах;
Перем мСведенияОСтатьяхЗатрат;
Перем мПустойСчет;


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Формирует запрос по шапке документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке() Экспорт
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("парамПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	Дата                                               	КАК Дата, 
	|	ПериодРегистрации                                  	КАК ПериодРегистрации, 
	|	ВЫБОР КОГДА Организация.ГоловнаяОрганизация = &парамПустаяОрганизация 
	|			ТОГДА Организация 
	|			ИНАЧЕ Организация.ГоловнаяОрганизация 
	|		  КОНЕЦ                                         КАК ГоловнаяОрганизация, 
	|	Организация											КАК Организация, 
	|	Организация											КАК ОбособленноеПодразделение, 
	| 	Ссылка                                              КАК Ссылка
	| 
	|	ИЗ	Документ.НачислениеКоммунальногоНалога
	| 
	|ГДЕ	Ссылка = &ДокументСсылка
	|";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// проверяет должен ли быть указан или нет счет учета по НУ
//
// Параметры
//  СчетДт,СчетКт - счета хозрасчетного плана счетов
//  СчетДтНУ	  - счет налогового плана счетов - будущий счет дебета
//
// Возвращаемое значение:
//   булево   – если сочетание корректно, то истина
//
Функция КорректноеСочетаниеСчетов(Выборка,Сообщение)
	
	Сообщение = "";
	
	СчетКт = Выборка.СчетКт;
	СчетДт = Выборка.СчетДт;
	
	Если (СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоОплатеТруда 
		или СчетДт = ПланыСчетов.Хозрасчетный.ПрочиеФинансовыеДоходы) Тогда
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Проводки в дебет %1 не должны отражаться в налоговом учете!';uk='Проводки в дебет %1 не повинні відображатись в податковому обліку!'"), Выборка.НаименованиеСчетДт);
	КонецЕсли;
	
	Возврат НЕ ЗначениеЗаполнено(Сообщение)
	
КонецФункции // КорректноеСочетаниеСчетов()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура АвтозаполнениеПроводок() Экспорт
	
	
	ОтражениеВУчете.Очистить();
	Записать();  // запишем документ
	
	ВыборкаПоПроводкам = СформироватьЗапросПроводки().Выбрать();
	
	ПлохиеДанные = Ложь;
	
	Пока ВыборкаПоПроводкам.Следующий() Цикл
		//ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоПроводкам, ПлохиеДанные);
		ДобавитьСтрокуВПроводки(ВыборкаПоПроводкам, ОтражениеВУчете);
	КонецЦикла;
	
	Если ПлохиеДанные Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры  // АвтозаполнениеПроводок

///////////////////////////////////////////////////////////////////////////
// общие функции для всех Автозаполнений

Функция ДобавитьСтрокуВПроводки(ДанныеУчета, ТЧ)
	
	СтрокаДанных = ТЧ.Добавить();
	// ресурсы
	
	Если Не ЗначениеЗаполнено(СтавкаКоммунальногоНалога) Тогда
		ПроведениеРасчетов.ОпределитьРегламентированныеПараметрыДляРасчетаКоммунальногоНалога(СтавкаКоммунальногоНалога, 0, ПериодРегистрации, Организация );
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НеоблагаемыйМинимум) Тогда
		ПроведениеРасчетов.ОпределитьРегламентированныеПараметрыДляРасчетаКоммунальногоНалога(0, НеоблагаемыйМинимум, ПериодРегистрации, Организация );
	КонецЕсли;

	СуммаНалога = СреднесписочнаяЧисленность * СтавкаКоммунальногоНалога * НеоблагаемыйМинимум; 
	СтрокаДанных.Сумма			= СуммаНалога;
	
	// реквизиты
	СтрокаДанных.НалоговоеНазначение	= ДанныеУчета.НалоговоеНазначение;
	
	СтрокаДанных.СчетДт      = ДанныеУчета.СчетДт;
	СтрокаДанных.СубконтоДт1 = ДанныеУчета.СубконтоДт1;
	СтрокаДанных.СубконтоДт2 = ДанныеУчета.СубконтоДт2;
	СтрокаДанных.СубконтоДт3 = ДанныеУчета.СубконтоДт3;
	
	СтрокаДанных.СчетКт      = ДанныеУчета.СчетКт;
	СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1;
	СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2;
	СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3;
	
	
	СтрокаДанных.СтатьяВаловыхРасходов	= ДанныеУчета.СтатьяВаловыхРасходов;
	
	Возврат СтрокаДанных;
	
КонецФункции     // ДобавитьСтрокуВПроводки()



///////////////////////////////////////////////////////////////////////////
// Автозаполнения




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПроводки()
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса  = "
	|ВЫБРАТЬ
	|	Основные.НалоговоеНазначение		КАК НалоговоеНазначение,
	|	Основные.СчетДт						КАК СчетДт,
	|	Основные.СубконтоДт1				КАК СубконтоДт1,
	|	Основные.СубконтоДт2				КАК СубконтоДт2,
	|	Основные.СубконтоДт3				КАК СубконтоДт3,
	|	Основные.СчетКт						КАК СчетКт,
	|	Основные.СубконтоКт1				КАК СубконтоКт1,
	|	Основные.СубконтоКт2				КАК СубконтоКт2,
	|	Основные.СубконтоКт3				КАК СубконтоКт3,    
	|	Основные.СтатьяВаловыхРасходов		КАК СтатьяВаловыхРасходов
	|	
	|ИЗ	Справочник.СпособыОтраженияЗарплатыВРеглУчете КАК Основные
	|ГДЕ Основные.Ссылка = &парамКоммунальный
	|
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("парамКоммунальный", СпособОтраженияВБухучете);
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПроводки()

Функция СформироватьЗапросПоОтражениюВУчете()
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ОтражениеЗарплаты.НомерСтроки				КАК НомерСтроки,
	|	ОтражениеЗарплаты.СтатьяВаловыхРасходов 	КАК СтатьяВаловыхРасходов,
	|
	|	ОтражениеЗарплаты.НалоговоеНазначение 							КАК НалоговоеНазначение,
	|	ОтражениеЗарплаты.НалоговоеНазначение.ВидНалоговойДеятельности 	КАК ВидНалоговойДеятельности,
	|
	|	ВЫБОР	КОГДА ОтражениеЗарплаты.СубконтоДт1 ССЫЛКА Справочник.ПодразделенияОрганизаций 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт1 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт2 ССЫЛКА Справочник.ПодразделенияОрганизаций 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт2 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт3 ССЫЛКА Справочник.ПодразделенияОрганизаций 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт3 
	|			ИНАЧЕ &ПустоеПодразделение 
	|	КОНЕЦ 	КАК ПодразделениеОрганизации,
	|
	|	ВЫБОР	КОГДА ОтражениеЗарплаты.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт1 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт2 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт3 
	|			ИНАЧЕ &ПустаяСтатьяЗатрат 
	|	КОНЕЦ 	КАК СтатьяЗатрат,
	|
	|	ВЫБОР	КОГДА ОтражениеЗарплаты.СубконтоДт1 ССЫЛКА Справочник.НоменклатурныеГруппы 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт1 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт2 ССЫЛКА Справочник.НоменклатурныеГруппы 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт2 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт3 ССЫЛКА Справочник.НоменклатурныеГруппы 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт3 
	|			ИНАЧЕ &ПустаяНоменклатурнаяГруппа 
	|	КОНЕЦ	КАК НоменклатурнаяГруппа,
	|
	|	ОтражениеЗарплаты.СчетДт				КАК СчетДт,
	|	ОтражениеЗарплаты.СчетДт.Наименование	КАК НаименованиеСчетДт,
	|	ОтражениеЗарплаты.СубконтоДт1			КАК СубконтоДт1,
	|	ОтражениеЗарплаты.СубконтоДт2			КАК СубконтоДт2,
	|	ОтражениеЗарплаты.СубконтоДт3			КАК СубконтоДт3,
	|	ВидСубконтоДт1.ВидСубконто				КАК ВидСубконтоДт1,
	|	ВидСубконтоДт2.ВидСубконто 				КАК ВидСубконтоДт2,
	|	ВидСубконтоДт3.ВидСубконто 				КАК ВидСубконтоДт3,
	|
	|	ОтражениеЗарплаты.СчетКт				КАК СчетКт,
	|	ОтражениеЗарплаты.СубконтоКт1			КАК СубконтоКт1,
	|	ОтражениеЗарплаты.СубконтоКт2			КАК СубконтоКт2,
	|	ОтражениеЗарплаты.СубконтоКт3			КАК СубконтоКт3,
	|	ВидСубконтоКт1.ВидСубконто 				КАК ВидСубконтоКт1,
	|	ВидСубконтоКт2.ВидСубконто 				КАК ВидСубконтоКт2,
	|	ВидСубконтоКт3.ВидСубконто 				КАК ВидСубконтоКт3,
	|
	|	ОтражениеЗарплаты.Сумма					КАК Сумма
	|
	|ИЗ	Документ.НачислениеКоммунальногоНалога.ОтражениеВУчете КАК ОтражениеЗарплаты
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоДт1
	|ПО ВидСубконтоДт1.Ссылка = ОтражениеЗарплаты.СчетДт И (ВидСубконтоДт1.НомерСтроки = 1)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоДт2
	|ПО ВидСубконтоДт2.Ссылка = ОтражениеЗарплаты.СчетДт И (ВидСубконтоДт2.НомерСтроки = 2)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоДт3
	|ПО ВидСубконтоДт3.Ссылка = ОтражениеЗарплаты.СчетДт И (ВидСубконтоДт3.НомерСтроки = 3)
	|
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоКт1
	|ПО ВидСубконтоКт1.Ссылка = ОтражениеЗарплаты.СчетКт И (ВидСубконтоКт1.НомерСтроки = 1)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоКт2
	|ПО ВидСубконтоКт2.Ссылка = ОтражениеЗарплаты.СчетКт И (ВидСубконтоКт2.НомерСтроки = 2)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоКт3
	|ПО ВидСубконтоКт3.Ссылка = ОтражениеЗарплаты.СчетКт И (ВидСубконтоКт3.НомерСтроки = 3)
	|
	|
	|ГДЕ	ОтражениеЗарплаты.Ссылка = &парамРегистратор
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	Запрос.УстановитьПараметр("РасходыБудущихПериодов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяНоменклатурнаяГруппа", Справочники.НоменклатурныеГруппы.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяСтатьяЗатрат", Справочники.СтатьиЗатрат.ПустаяСсылка());
	
	Возврат Запрос.Выполнить();
	
КонецФункции  // СформироватьЗапросПоОтражениюВУчете()



// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не задана организация!';uk='Не задана організація!'"), Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не задан период за который выполняется отражение начислений в бухгалтерском учете!';uk='Не заданий період за який виконується відображення нарахувань у бухгалтерському обліку!'"), Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()


Процедура ПроверитьЗаполнениеСтрокиОтраженияВУчете(ВыборкаПоДоходам, Отказ, Заголовок = "")
	
	СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табл. части ""Проводки"": ';uk='У рядку номер ""%1"" табл. частини ""Проводки"": '"), СокрЛП(ВыборкаПоДоходам.НомерСтроки));
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоДоходам.СчетДт) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='Не указан счет дебета!';uk='Не зазначений рахунок дебету!'"), Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоДоходам.СчетКт) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='Не указан счет кредита!';uk='Не зазначений рахунок кредиту!'"), Отказ);
	КонецЕсли;
	
	Сообщение = "";
	Если Не КорректноеСочетаниеСчетов(ВыборкаПоДоходам,Сообщение) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + Сообщение, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиОтраженияВУчете()

Процедура ДобавитьСтрокуВДвиженияПоОтражениюВУчете(СтруктураШапкиДокумента, ВыборкаПоДоходам, ВалютаРеглУчета)
	
	Если ВыборкаПоДоходам.Сумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// проводка по бухгалтерскому регистру
	Проводка = Движения.Хозрасчетный.Добавить();
	
	Проводка.Активность = Истина;
	Проводка.Период     = СтруктураШапкиДокумента.Дата;
	
	Проводка.Организация	= Организация;
	Проводка.Сумма			= ВыборкаПоДоходам.Сумма;
	Проводка.НомерЖурнала	= "ЗП";
	
	// бухучет
	Проводка.СчетДт       = ВыборкаПоДоходам.СчетДт;
	Проводка.СчетКт       = ВыборкаПоДоходам.СчетКт;
	Проводка.СубконтоДт[ВыборкаПоДоходам.ВидСубконтоДт1] = ВыборкаПоДоходам.СубконтоДт1;
	Проводка.СубконтоДт[ВыборкаПоДоходам.ВидСубконтоДт2] = ВыборкаПоДоходам.СубконтоДт2;
	Проводка.СубконтоДт[ВыборкаПоДоходам.ВидСубконтоДт3] = ВыборкаПоДоходам.СубконтоДт3;
	Проводка.СубконтоКт[ВыборкаПоДоходам.ВидСубконтоКт1] = ВыборкаПоДоходам.СубконтоКт1;
	Проводка.СубконтоКт[ВыборкаПоДоходам.ВидСубконтоКт2] = ВыборкаПоДоходам.СубконтоКт2;
	Проводка.СубконтоКт[ВыборкаПоДоходам.ВидСубконтоКт3] = ВыборкаПоДоходам.СубконтоКт3;
	
	ЕстьЗатраты = ВыборкаПоДоходам.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат,"ВидСубконто") <> Неопределено;

	// Проверим, отражать ли в налоговом учете
	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		Если  ВыборкаПоДоходам.НалоговоеНазначение.ВидНалоговойДеятельности <> Справочники.ВидыНалоговойДеятельности.НеОблагаемая
			И НЕ ВыборкаПоДоходам.НалоговоеНазначение.Амортизируется 
			И ЗначениеЗаполнено(ВыборкаПоДоходам.СтатьяВаловыхРасходов) Тогда
			     
			// проводка по ВР
			Проводка = Движения.Налоговый.Добавить();

			Проводка.Период                                 = СтруктураШапкиДокумента.Дата;
			Проводка.Активность                             = Истина;
			Проводка.Организация                            = СтруктураШапкиДокумента.Организация;
			Проводка.Сумма                                  = ВыборкаПоДоходам.Сумма;
			Проводка.Содержание                             = "ВР: зарплата";
			Проводка.НомерЖурнала                           = "";
				
			Проводка.СчетДт                           		= ПланыСчетов.Налоговый.ВаловыеРасходы;
			Проводка.СубконтоДт.ВидыНалоговойДеятельности  	= ВыборкаПоДоходам.ВидНалоговойДеятельности;
			Проводка.СубконтоДт.СтатьиНалоговогоУчета 		= ВыборкаПоДоходам.СтатьяВаловыхРасходов;
			
			Проводка.СчетКт                           		= ПланыСчетов.Налоговый.ВаловыеРасходы;
			Проводка.СубконтоКт.ВидыНалоговойДеятельности  	= ВыборкаПоДоходам.ВидНалоговойДеятельности;
			Проводка.СубконтоКт.СтатьиНалоговогоУчета 		= ВыборкаПоДоходам.СтатьяВаловыхРасходов;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  // ДобавитьСтрокуВДвиженияПоОтражениюВУчете()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ПроведениеРасчетов.ИспользуетсяНК(ПериодРегистрации) Тогда
		Сообщить(НСтр("ru='С 01.01.2011 г. коммунальный налог отменен и документ больше не используется';uk='З 01.01.2011 комунальний податок скасовано і документ більше не використовується'"),СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Получим данные учетной политики
	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	
	// При получении учетной политики произошли ошибки
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеШапки(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПоОтражениюВУчете = СформироватьЗапросПоОтражениюВУчете().Выбрать();
	ВалютаРеглУчета  = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Пока ВыборкаПоОтражениюВУчете.Следующий() Цикл
		
		ПроверитьЗаполнениеСтрокиОтраженияВУчете(ВыборкаПоОтражениюВУчете, Отказ, Заголовок);
		
		Если Не Отказ Тогда
			ДобавитьСтрокуВДвиженияПоОтражениюВУчете(СтруктураШапкиДокумента, ВыборкаПоОтражениюВУчете, ВалютаРеглУчета);
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мПустойСчет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
мСведенияОСчетах = Новый Соответствие;
мСведенияОСтатьяхЗатрат = Новый Соответствие;
